# Brewfile - Homebrew Bundle
# Install with: brew bundle install

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# =============================================================================
# Core CLI Tools
# =============================================================================

# Shell & Terminal
brew "zsh"
brew "tmux"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "fzf"
brew "direnv"

# Editors
brew "neovim"

# AI Coding Assistants
brew "opencode"
cask "claude-code"

# Git & GitHub
brew "gh"
brew "lazygit"

# Search & Navigation
brew "ripgrep"
brew "fd"                     # Fast find alternative
brew "fzf"
brew "tree"
brew "jq"
brew "wget"
brew "bat"                    # Cat with syntax highlighting

# =============================================================================
# Languages & Runtimes
# =============================================================================

# Node.js (via fnm - Fast Node Manager)
brew "fnm"
brew "bun"

# Go
brew "go"

# Python
brew "python@3.13"
brew "pipx"

# Java
brew "openjdk"
cask "zulu@17"

# .NET
cask "dotnet-sdk"

# =============================================================================
# Development Tools
# =============================================================================

# Code Quality
brew "shellcheck"              # Shell script linter
brew "sonar-scanner"

# Database
brew "postgresql@14"
brew "mongosh"
brew "turso"
brew "sqld"

# Cloud & Infrastructure
brew "act"                    # GitHub Actions locally

# Misc Dev Tools
brew "cmake"
brew "staticcheck"            # Go linter
brew "swift-format"
brew "golang-migrate"

# =============================================================================
# Media & Utilities
# =============================================================================

brew "ffmpeg"
brew "imagemagick"
brew "neofetch"
brew "speedtest"
brew "glow"                   # Markdown renderer

# =============================================================================
# macOS Applications (Casks)
# =============================================================================

# Terminal
cask "ghostty"

# Automation
cask "hammerspoon"
cask "karabiner-elements"     # Keyboard customisation

# Cloud
cask "google-cloud-sdk"

# Music
cask "music-presence"         # Discord Rich Presence for Apple Music

# =============================================================================
# Fonts
# =============================================================================

# Nerd Fonts for terminal icons
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"
